import Footer from "../HomePage/Footer";
import React from "react";
import DreamersDayHeader from "../DreamersDay/DreamersDayHeader";
type Article = {
  _id: string;
  title: string;
  imageUrl: string;
};

const ArticleDetail = ({ articleData }: { articleData: Article | null }) => {
  if (!articleData) {
    return <div>Article not found!</div>;
  }

  return (
    <div className="movie-detail-container flex flex-col justify-center">
      <DreamersDayHeader />
      <div className="flex  items-center flex-col">
        <div className="w-[1180px] ">
          <p className="text-black text-center font-['Helvetica Neue'] text-4xl font-bold leading-[42px]">
            БОЛДООГИЙН САНАЛ БОЛГОХ ШИЛДЭГ 15-Н КИНО
          </p>
          <div className="p-8 border border-t-[#00000073] border-r-white border-l-white border-b-white flex flex-col gap-8 ">
            <p>
              “Хүрд” кино нь амиа хорлосон хүмүүсийн ар гэрийнхэн болон амиа
              хорлохоор оролдож байсан хүмүүстэй хийсэн ярианаас бүтжээ. Гэр
              бүлийн хүчирхийлэл, ажилгүйдэл, ядуурал, ялгаварлан гадуурхалт,
              итгэл найдварын мухардал, хувь хүний үнэ цэнийн эрэмбийн гажуудал
              гээд амиа хорлолтод хөтөлдөг олон хүчин зүйлс, нөхцөл байдлын
              тухай үзэгч бид киноны туршид олж мэдэх юм.
            </p>
            {articleData.imageUrl && (
              <img
                src={articleData.imageUrl}
                alt={articleData.title || "Movie Poster"}
                className="movie-poster"
              />
            )}
            <p>
              Саяхныг хүртэл баримтат киног баримтат нэвтрүүлгээс ялгаж байдаг
              уран сайхны шийдэл, кино хэл гэх зүйлс манай баримтат кинонуудад
              дутагддаг байжээ. Харин “Хүрд” киноны хувьд баримтат киноны
              монолог ихтэй, хэт хатуу хөндий байдлыг эвдэж чадсан, амьд мэдрэг
              бүтээл болсон байлаа. Угаас ийм “амьд” үзэл санааг хүргэж буй кино
              амьд мэдрэг байхгүй гээд яах билээ? Ухарч буй цаг, овооны дэргэд
              аажим үзэгдэх хүмүүсийн царай төрх, эгэл бор ахуйн зураглал
              зэргээс эхсүүлээд үзэгчтэйгээ гүн гүнзгий харилцаа үүсгэх шийдлээ
              маш гоё олжээ. Мөн хамгийн авууштай нэг зүйл нь, кино багийнхан
              дүрүүдийнхээ хувийн орон зайг маш сайн хүндэтгэсэн явдал байв.
              Амиа хорлолтыг биеэр гэрчилж туулсан хүмүүсийн чин үнэн мэдрэмж
              бүхий яриа л сонстож байлаа. Харин тэдний амьдралыг хэт их ухаж
              төнхсөн, хэрэгцээгүй шалдар булдар асуултаар булсан зүйл байгаагүй
              нь их таалагдлаа. Уран бүтээлчид нь киноны дүрүүдээ тас
              хамгаалаад, хэрийн үзэгчид шүүн чичлэх боломж өгсөнгүй, үүгээрээ
              маш эмзэг сэдвийг туйлын ёс зүйтэй хөнджээ гэж хэлмээр байна.
              Мэргэжлийн сэтгүүлч хүн зохиож, найруулсны үр дүн биз ээ.
              Хүмүүсийн амиа хорлох нөхцөл байдал, шалтгаан, хүчин зүйлсийг нээн
              илрүүлэх явцад нийгэм дэх хамгийн ужгирсан асуудлуудын мөн чанар
              давхар нээгдэж байгааг “Хүрд” киноноос анзаарч болох юм. Нийгэмд
              дангаар оршдог асуудал гэж байхгүй. Нийгмийн асуудлууд бүгд өөр
              хоорондоо холбоотой. Эдийн засаг, нийгэм хөрвөөж хувьсах бүрт хэн
              нэгэн хоолноосоо салж ядуурал руу унана, ядуурлаас ялгаварлан
              гадуурхалт болоод итгэл найдварын мухардал, мухардсан итгэл
              найдвараас архидалт, архидалтаас гэр бүлийн дотоод асуудал, гэр
              бүлийн асуудлаас хувь хүний сэтгэлзүйн асуудал, сэтгэлзүйн
              асуудлаас амиа хорлолт гэхчилэн нийгмийн асуудлууд өөр хоорондоо
              тас сугадалцаад тамын тойрог шиг эргэлдэж байдаг. Амиа хорлолт ч
              бас дангаар оршдог асуудал биш. Нийгмийн болоод хүний хувийн
              амьдралын бусад асуудлуудтай тас зууралдсан байгааг “Хүрд”
              киноноос харж болох юм.
            </p>
            {articleData.imageUrl && (
              <img
                src={articleData.imageUrl}
                alt={articleData.title || "Movie Poster"}
                className="movie-poster"
              />
            )}
            <div className="flex flex-col gap-4">
              <p>Does It Mean Anything?</p>
              <p>
                Мэргэжлийн сэтгүүлч хүн зохиож, найруулсны үр дүн биз ээ.
                Хүмүүсийн амиа хорлох нөхцөл байдал, шалтгаан, хүчин зүйлсийг
                нээн илрүүлэх явцад нийгэм дэх хамгийн ужгирсан асуудлуудын мөн
                чанар давхар нээгдэж байгааг “Хүрд” киноноос анзаарч болох юм.
                Нийгэмд дангаар оршдог асуудал гэж байхгүй. Нийгмийн асуудлууд
                бүгд өөр хоорондоо холбоотой. Эдийн засаг, нийгэм хөрвөөж
                хувьсах бүрт хэн нэгэн хоолноосоо салж ядуурал руу унана,
                ядуурлаас ялгаварлан гадуурхалт болоод итгэл найдварын мухардал,
                мухардсан итгэл найдвараас архидалт, архидалтаас гэр бүлийн
                дотоод асуудал, гэр бүлийн асуудлаас хувь хүний сэтгэлзүйн
                асуудал, сэтгэлзүйн асуудлаас амиа хорлолт гэхчилэн нийгмийн
                асуудлууд өөр хоорондоо тас сугадалцаад тамын тойрог шиг
                эргэлдэж байдаг. Амиа хорлолт ч бас дангаар оршдог асуудал биш.
                Нийгмийн болоод хүний хувийн амьдралын бусад асуудлуудтай тас
                зууралдсан байгааг “Хүрд” киноноос харж болох юм.
              </p>
            </div>
          </div>
        </div>
      </div>
      <Footer />
    </div>
  );
};
export default ArticleDetail;
